Workspace/test_cases/vertificating/sineWaveDampingPimpleFoam-classic/system/blockMeshDict.01
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2006                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

scale   1;

vertices
(
    (0 -0.01 -0.01)
    (10 -0.01 -0.01)
    (10 0.01 -0.01)
    (-0 0.01 -0.01)
    (-0 -0.01 0.01)
    (10 -0.01 0.01)
    (10 0.01 0.01)
    (-0 0.01 0.01)
);

blocks
(
    hex (0 1 2 3 4 5 6 7) (4000 1 1) simpleGrading (1 1 1)
);

edges
(
);

boundary
(
    inlet
    {
        type patch;
        faces
        (
            (0 4 7 3)
        );
    }


    outlet
    {
        type patch;
        faces
        (
            (1 2 6 5)
        );
    }

    frontAndBack
    {
        type empty;
        faces
        (
            (0 1 5 4)
            (3 7 6 2)
            (0 3 2 1)
            (5 6 7 4)
        );
    }
);

mergePatchPairs
(
);

// ************************************************************************* //
